app/views/genres/show.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "song_genres" ON "songs"."id" = "song_genres"."song_id" WHERE "song_genres"."genre_id" = ?  [["genre_id", 1]]
---
<ul>
<% @genre.songs.each do |song| %>