app/controllers/genres_controller.rb

INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 26 Jan 2016 20:03:35 UTC +00:00], ["name", "TESTING"], ["updated_at", Tue, 26 Jan 2016 20:03:35 UTC +00:00]]
---
  def create
    @genre = Genre.new(genre_params)

    respond_to do |format|
      if @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_genre
      @genre = Genre.find(params[:id])